dog_adoption_system/app/views/layouts/application.html.erb

              <ul class="dropdown-menu">
                <li><span class="dropdown-item-text"><strong>Available:</strong> <%= Dog.where(available_for_adoption: true).count %> dogs</span></li>
---
SELECT COUNT(*) FROM "dogs" WHERE "dogs"."available_for_adoption" = 0

                <li><hr class="dropdown-divider"></li>
                <li><span class="dropdown-item-text"><strong>Total:</strong> <%= Owner.count %> owners</span></li>
---
SELECT COUNT(*) FROM "owners"