dog_adoption_system/app/views/breeds/index.html.erb

            <div class="col-md-3">
              <h4 class="text-info"><%= Dog.count %></h4>
---
SELECT COUNT(*) FROM "dogs"