dog_adoption_system/app/controllers/breeds_controller.rb

  def index
    # Get all unique breeds with counts - simplified approach
    breeds_list = Dog.distinct.pluck(:breed).sort

    @breeds_data = breeds_list.map do |breed|
      dogs_in_breed = Dog.where(breed: breed)
      {
        breed: breed,
        total_count: dogs_in_breed.count,
        available_count: dogs_in_breed.where(available_for_adoption: true).count,
        adopted_count: dogs_in_breed.where(available_for_adoption: false).count
---
SELECT DISTINCT "dogs"."breed" FROM "dogs"
SELECT COUNT(*) FROM "dogs" WHERE "dogs"."breed" = 'African' AND "dogs"."available_for_adoption" = 1

  def show
    @breed_name = params[:breed_name]
    @dogs = Dog.where(breed: @breed_name).order(:name)
    @available_dogs = @dogs.where(available_for_adoption: true)
    @adopted_dogs = @dogs.where(available_for_adoption: false)

    if @dogs.empty?
      redirect_to breeds_path, alert: "Breed '#{@breed_name}' not found."
      return
    end

    @breed_stats = {
      total: @dogs.count,
      available: @available_dogs.count,
      adopted: @adopted_dogs.count
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."breed" = 'Terrier' AND (name LIKE '%friendly%' OR description LIKE '%friendly%') ORDER BY "dogs"."name" ASC
SELECT "dogs".* FROM "dogs" WHERE "dogs"."breed" = 'Dachshund' AND "dogs"."available_for_adoption" = 1 ORDER BY "dogs"."name" ASC
SELECT 1 AS one FROM "dogs" WHERE "dogs"."breed" = 'Dachshund' LIMIT 1
SELECT COUNT(*) FROM "dogs" WHERE "dogs"."breed" = 'Dachshund' AND "dogs"."available_for_adoption" = 1