dog_adoption_system/app/controllers/dogs_controller.rb

  def index
    @dogs = Dog.all.order(:name)
    @available_dogs = Dog.available.order(:name)
    @adopted_dogs = Dog.adopted.order(:name)
    @total_count = @dogs.count
---
SELECT COUNT(*) FROM "dogs"

  def show
    @dog = Dog.find(params[:id])
    @adoption = @dog.adoptions.includes(:owner).first
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = 72 LIMIT 1
SELECT "adoptions".* FROM "adoptions" WHERE "adoptions"."dog_id" = 72 ORDER BY "adoptions"."id" ASC LIMIT 1