dog_adoption_system/app/controllers/dogs_controller.rb

  def index
    @all_breeds = Dog.distinct.pluck(:breed).sort

    @dogs = Dog.all.order(:name)

    if params[:breed].present?
      @dogs = @dogs.where(breed: params[:breed])
      @breed_filter = params[:breed]
    end

    if params[:search].present?
      search_term = params[:search].strip
      @dogs = @dogs.where(
        "name LIKE ? OR breed LIKE ? OR description LIKE ?",
        "%#{search_term}%", "%#{search_term}%", "%#{search_term}%"
      )
      @search_performed = true
      @search_term = search_term
    end

    @available_dogs = @dogs.where(available_for_adoption: true).order(:name)
    @adopted_dogs = @dogs.where(available_for_adoption: false).order(:name)
    @total_count = @dogs.count
---
SELECT DISTINCT "dogs"."breed" FROM "dogs"
SELECT "dogs".* FROM "dogs" ORDER BY "dogs"."name" ASC
SELECT "dogs".* FROM "dogs" WHERE "dogs"."breed" = 'Rottweiler' ORDER BY "dogs"."name" ASC
SELECT "dogs".* FROM "dogs" WHERE "dogs"."breed" = 'Rottweiler' AND "dogs"."available_for_adoption" = 1 ORDER BY "dogs"."name" ASC
SELECT COUNT(*) FROM "dogs" WHERE "dogs"."breed" = 'Rottweiler'

  def show
    @dog = Dog.find(params[:id])
    @adoption = @dog.adoptions.includes(:owner).first
---
SELECT "dogs".* FROM "dogs" WHERE (id < 72) ORDER BY "dogs"."id" DESC LIMIT 1
SELECT "adoptions".* FROM "adoptions" WHERE "adoptions"."dog_id" = 72 ORDER BY "adoptions"."id" ASC LIMIT 1