dog_adoption_system/app/controllers/pages_controller.rb

SELECT COUNT(*) FROM "owners"
SELECT COUNT(*) FROM "adoptions"
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" IN (67, 56, 71, 55, 44)
SELECT "owners".* FROM "owners" WHERE "owners"."id" IN (20, 24, 32, 15, 12)
---
  def home
    @available_dogs_count = Dog.available.count
    @adopted_dogs_count = Dog.adopted.count
    @total_owners = Owner.count
    @total_adoptions = Adoption.count
    @recent_adoptions = Adoption.includes(:dog, :owner).recent.limit(5)