dog_adoption_system/app/views/dogs/show.html.erb

SELECT "dogs".* FROM "dogs" WHERE (id < 72) ORDER BY "dogs"."id" DESC LIMIT 1
SELECT "dogs".* FROM "dogs" WHERE (id > 72) ORDER BY "dogs"."id" ASC LIMIT 1
---
      <!-- Previous/Next Navigation -->
      <% prev_dog = Dog.where("id < ?", @dog.id).order(id: :desc).first %>
      <% next_dog = Dog.where("id > ?", @dog.id).order(id: :asc).first %>