dog_adoption_system/app/views/pages/about.html.erb

                  <p><strong>Data:</strong> Real dog breed information and authentic breed images</p>
                  <p class="mt-auto"><strong>Usage:</strong> Populates our Dogs table with <%= Dog.count %> dogs from <%= Dog.distinct.count(:breed) %> different breeds</p>
---
SELECT COUNT(DISTINCT "dogs"."breed") FROM "dogs"

                  <p><strong>Data:</strong> Realistic owner contact information</p>
                  <p class="mt-auto"><strong>Usage:</strong> Generated <%= Owner.count %> potential adopters with names, emails, addresses, and phone numbers</p>
---
SELECT COUNT(*) FROM "owners"

                  <p><strong>Data:</strong> Adoption history and records</p>
                  <p class="mt-auto"><strong>Usage:</strong> Created <%= Adoption.count %> adoption records with dates, fees, and notes</p>
---
SELECT COUNT(*) FROM "adoptions"

                  <td>breed, name, age, image_url, description, available_for_adoption</td>
                  <td><%= Dog.count %></td>
---
SELECT COUNT(*) FROM "dogs"

                  <td>name, email, phone, address, city, state, zip_code</td>
                  <td><%= Owner.count %></td>
---
SELECT COUNT(*) FROM "owners"

                  <td>dog_id, owner_id, adoption_date, adoption_fee, notes</td>
                  <td><%= Adoption.count %></td>
---
SELECT COUNT(*) FROM "adoptions"

                <div class="card-body">
                  <h4><%= Dog.where(available_for_adoption: true).count %></h4>
---
SELECT COUNT(*) FROM "dogs" WHERE "dogs"."available_for_adoption" = 1

                <div class="card-body">
                  <h4><%= Dog.where(available_for_adoption: false).count %></h4>
---
SELECT COUNT(*) FROM "dogs" WHERE "dogs"."available_for_adoption" = 0

                <div class="card-body">
                  <h4><%= Owner.count %></h4>
---
SELECT COUNT(*) FROM "owners"

                <div class="card-body">
                  <h4><%= Adoption.count %></h4>
---
SELECT COUNT(*) FROM "adoptions"